{
    "before-robot": [
        {
            "title": "Site and Robot Selection",
            "content": [
                "Evaluate which robot to use in the specific site",
                "Pick a suitable site for the robot you have",
                "Ensure that the site and robot pairing is suitable to address research goals"
            ],
            "description": "Not only does a site and specific robot need to be selected, but the site cannot impede the robot's ability to perform its task, and the robot must be well-suited to the site. The choice of robot and site will heavily influence one another. For example, a robot with small wheels would be a poor choice for a cobbled public square, but may perform well in a museum with smooth marble floors. Likewise, if one is choosing a robot to evaluate social navigation policies in outdoor settings, it is likely a good idea to choose a robot with large, robust wheels or to consider other robot locomotion morphologies. This topic is separated on its own because the site and robot selection process is often iterative as new information is discovered about the site and robot constraints and opportunities."
        },
        {
            "title": "Robot Programming",
            "content": [
                "Test Emergency shut-down procedure",
                "Equip and test the robot for obstacle detection",
                "Plan for potential collisions despite obstacle detection",
                "Implement protocols for the robot to maintain a safe distance",
                "Consider mobility aids, such as wheelchairs or canes",
                "Prepare for groups of people and multiple interactants"
            ],
            "description": "The approach to programming the robot will be vastly different for each robot, deployment, and researcher. However, common principles apply: all robots must have emergency shutdown procedures, and robots will likely need to detect or avoid objects. This includes not just locomotion, but any robot movement. For example, a robot barista must know the location of the coffee, mugs, and serving area. It must be able to detect and avoid colliding with the countertop. If a robot does locomote, researchers should be aware of the potential negative impact of obstructing the path of someone using mobility aids. For instance, a delivery robot that halts when it reaches a crack in the sidewalk could block the way for wheelchair users that cannot easily maneuver around. \n Robots that are deployed in public will inevitably encounter groups of people. Because encounters with the robot are, by nature, unstructured, groups will not only pass by, but may interact with the robot. Robot programmers should prepare accordingly and should deliberately decide how the robot should respond."
        },
        {
            "title": "Site Visits",
            "content": [
                "Visit site at similar time to expected deployment",
                "Explore how the robot will move in the space",
                "Identify potentially challenging areas for locomotion or sensing (tactile paving, gutters, staircases)",
                "Try out Wi-Fi connection/setup in multiple locations",
                "Locate power sources for charging during the day"
            ],
            "description": "Before the robot is brought to the site, research team members should visit and assess the site to assess whether it is suitable for their project. Multiple site visits without the robot may be necessary. Throughout these visits, the team should be assessing whether the research questions, the robot's task, and/or the robot are suitable for the site. For instance, a robot that relies on hearing spoken responses cannot be deployed at a noisy festival. This visit should be done at a similar time to when the deployment is expected to happen. As an example, visiting a transit station at night when the study is intended to occur during the day will provide an unrepresentative sense of what challenges the researchers should anticipate. Exploring the space allows researchers to understand how the robot will interface with the space around it and allows them to identify challenging areas such as tactile paving that a robot may not be able to navigate over, or for a stationary robot, a location where the robot does not have sufficient lighting for its sensors. Common examples worthy of their own checklist items are examining continuous Wi-Fi coverage as well as locating power sources to charge a battery whenever needed. \n Envision the robot and its handlers in the space - start thinking about where the robot should go and how the deployment will be conducted. A successful site visit is one where information is gathered that helps the research team make decisions about when, where, and how the robot should be deployed."
        },
        {
            "title": "Safe Robot Transportation to Site",
            "content": [
                "Identify the best route/method to transport robot to site",
                "Protect sensitive equipment",
                "Document disassembly and re-assembly process",
                "Create an item inventory to ensure that all robot equipment and basic maintenance tools are brought to the site",
                "Have a place to store the robot (night/day)"
            ],
            "description": "Transporting the robot is an unsung, but often time-consuming and challenging task. Robots designed for indoor use may have trouble driving over exterior terrain to reach the deployment site. Equipment may be jostled and delicate sensors and electronics may be damaged by rough transportation. If the robot is disassembled to any degree for transportation, it is critical to have robust, thorough documentation for the disassembly, packing, and reassembly process. This documentation should also include a material inventory with a robot packing list, robot-related accessories like extension cords or covers, and basic maintenance tools like hex keys, screwdrivers, and tape. All members of the research team should be trained in this process to ensure that the robot assembly and disassembly does not rely on a single person's availability. Coordinating with the site to have a place to store the robot when not in use during the deployment is a helpful way to reduce wear-and-tear on the robot from the transportation process."
        },
        {
            "title": "A priori Information and Resources",
            "content": [
                "Acquire or plan to build maps",
                "Build necessary dictionaries etc. for semantic information",
                "Ensure code for data storage",
                "Develop or check remote monitoring software",
                "Try to have a backup/alternative robot or robot parts"
            ],
            "description": "Many robots need information about the deployment site available in order to operate smoothly. For example, many robots that locomote may need a map, especially those meant to deliver items or give directions. Likewise, the robot may need tools for understanding semantic information, like differentiating between walls, doorways, and stairwells. If a code or key is required to anonymize the data as it is being recorded, this should also be planned for and provided.\n Remote monitoring software can be extremely useful for making the deployment process smoother. This tool could be as simple as displaying motor commands and the robot's current state. Monitoring software can also help robot handlers to differentiate between different robot states that appear very similar but require different levels of intervention. Consider a robot that should be moving out of the way of a group of people but is standing still. It could have a malfunctioning motor or the people could be out of range of its body tracking sensors. Both cause the robot to exhibit the same behavior - motionlessness - but if a motor is malfunctioning the robot should be shut down and serviced, whereas if the robot has not yet started tracking the group of people, it may be that no action is needed. Without a tool for monitoring the robot's internal state, it may be difficult for the robot handler to gauge the need for intervention. \n In some cases, it is possible to have an alternative or backup robot. Even if there are only replacement parts available, planning to use these if necessary can be very useful in the case that a part malfunctions. A second robot can also be useful for testing whether a problem is persistent throughout a system, or may be robot-specific."
        },
        {
            "title": "In-Lab Pre-Testing",
            "content": [
                "Test the robot features (e.g. tracking, recognition, safety features) in the lab beforehand",
                "Test the robot in simulation or a mock-up of the site if possible."
            ],
            "description": "While there is no replacement for onsite testing, verifying that the robot works in the lab environment is a helpful sanity check before reaching the deployment site. Building simulations of the robot can help significantly reduce the robot development time, especially if it is possible to simulate the deployment site. Not only will this help test robot capabilities, but the process of simulating the deployment site can help you recognize potential opportunities and pitfalls."
        },
        {
            "title": "Accessibility of Robot Features",
            "content": [
                "Select colors (for projections, displays) with color vision limitations in mind",
                "Ensure volume adjustment and subtitling for videos are available when possible"
            ],
            "description": "Robot accessibility is not just about accommodating people with cognitive, visual, auditory, or mobility impairments. It is also about ensuring that the robot can be understood and is acting appropriately in its environment. Even if a robot seems perfectly understandable in a quiet lab setting with controllable lighting conditions, it may be difficult to decipher robot utterances and view screens once it is in a public setting. Accessibility features like subtitles can help improve robot understanding, especially in noisy, crowded locations. Likewise, colorblind-friendly display choices are not only more inclusive, they can also help people with normal vision better distinguish screen elements in a bright environment.\n Volume settings can also be a feature of accessibility. If the ambient noise is variable, it may be desirable for the robot to adjust its volume to be understood while avoiding disruption."
        },
        {
            "title": "Site Pre-Testing",
            "content": [
                "Run pre-tests with the robot on-site, including with people",
                "Verify you are collecting the right data",
                "Identify locations where post-interaction interviews/surveys can be conducted",
                "Choose a location for robot handlers"
            ],
            "description": "This is one of the most important steps to prepare for a deployment. Expect at least one thing to go wrong or behave unexpectedly when transitioning out of a lab environment. Schedule more time than you think you will need to conduct onsite tests and to incorporate any modifications needed after testing. \n Testing the robot onsite should be as reflective of the deployment conditions as possible. If this proves challenging, be creative about how to simulate a more representative environment. For example, if you can only pre-test in an office building lobby after 6pm, bring extra members of the research team, lab mates, or even friends to populate the environment.\n Check, then double check, that your system is recording the correct data. Use the pre-test as an opportunity to get dry-run recordings and verify after the test that these recordings contain all of the data you want to use. It is devastating than returning after a successful deployment day to realize that the recording system malfunctioned and you have no data. \n Choosing a spot for robot handlers is important - in some cases, they will need to be very close to the robot. In other cases, they should be out of the robot's field of view unless servicing the robot. If possible, note the sensor ranges and distance for functionality of any remote monitoring tools at the site - these can be helpful both for choosing a spot for handlers to sit and when debugging the robot. \n If research team members are conducting interviews or surveys, find locations where these can be done without interrupting traffic flow. Often, a space near a wall, pillar, or an alcove is sufficiently unobtrusive. Develop a plan for how research team members will approach people who interacted with the robot respectfully and warmly. Be aware that people may be more willing to interact with the robot than to participate in an interview or survey. \n This is the time to ensure that the robot is ready to run during the deployment. Consider asking yourself the following questions: 1) Does the robot have the resources it needs to perform its task, including physical space, power, Wi-Fi, and data streams? 2) Is the system collecting all of the data necessary for evaluation of my research questions? 3) Is the robot handling and recovering from errors as expected? 4) Does the robot behave safely and can I shut it down in an emergency?"
        },
        
        {
            "title": "Set Up Robot Infrastructure",
            "content": [
                "Plan the additional sensors and physical modification needed for robot deployment",
                "Setup the charging infrastructure",
                "Develop and deploy the modifications."
            ],
            "description": "Often, once a site and robot are selected, it is necessary to make modifications to the robot or the site to ensure research goals are met. For instance, a robot that has a narrow field of view from onboard cameras that is deployed the large, open lobby of a shopping mall may need additional environment sensors or a different camera array to detect when people are nearby and interested in interacting. Environment sensors can take many forms, from cameras to LIDAR to microphones, but care should be taken to sync the data from each external sensor for post-hoc analysis. Charging infrastructure can also impact the success of robot deployments. Robots may become stranded if they cannot monitor their battery, or return to their charger. This may happen if the charger is placed in a spot that is difficult for the robot to reach or the robot is unable to localize itself in its internal map. Developing these modifications may be time-consuming, and it is important to prioritize and plan adequate time for changes to sensors, hardware, and infrastructure."
        }
    ],
    "during-robot": [
        {
            "title": "Robot Support",
            "content": [
                "Determine whether a robot handler needs to stay close to monitor robot",
                "Plan robot handler schedule and responsibilities",
                "Implement systems to inform robot handlers and participants when errors occur",
                "Work closely with people from the robotics company if possible"
            ],
            "description": "Robot handlers are the people who specifically help with deploying the robot. Sometimes, handlers are acting in a supporting role to the researchers who are driving the research for the deployment or have less robotics experience than the main research team. Based on ethical, institutional, and safety regulations and best practices for your location, determine if you need any robot handlers and what their responsibilities will be. If you decide you need a robot handler, one should be with the robot at all times. \n Whether using a remote monitoring tool or not, clear guidelines should be in place to inform both robot handlers and participants when the robot is malfunctioning. This will help handlers to intervene when appropriate, and set participant expectations for the robot's behavior in that moment. Participants can be encouraged to return later if they were excited about interacting with the robot. \n If more detailed, technical support of the robot is required, reaching out directly to the robotics company can often be useful, especially if the research team does not have a background in hardware development."
        },
        {
            "title": "Resetting the Experiment",
            "content": [
                "Reset code/conditions/props, record when they were reset",
                "Restart robot monitoring software if needed",
                "Restart robot(s) if needed"
            ],
            "description": "Sometimes, robots need to be reset. Depending on the research goals, this may be deliberate (like in a user study where conditions might require setup), or it may be a result of a malfunction. In either case, it is important to create a plan for how the robot will be reset or restarted, especially if a robot handler who is not normally part of the research team is responsible for resetting the robot. When the robot is reset, it is best practice to record when the reset happens. This serves two practical purposes. First, if the robot is still recording data, the data of the handler intervention can be removed from the final dataset. Second, it provides a record that can be used to track useful metrics, such as robot uptime or as a secondary count of the number of interactions that should be found in the data."
        },
        {
            "title": "Documentation",
            "content": [
                "Document any changes to the robot",
                "Document any changes to the necessary a priori information or environment and the resulting robot procedure",
                "Include detailed documentation of robot failures, as this is often very useful"
            ],
            "description": "Documentation of this nature can take written or visual form. Any changes made to the robot setup process, or the information required by the robot, should be documented. Sometimes these are one-off occurrences, but more often they indicate potential areas of improvement or errors that need to be addressed. \n Even with the most carefully laid plan, many unexpected and interesting things will happen during every deployment. Some are delightful, some are perplexing, and some are frustrating. These should be documented in detail, including the date and time so they can be correlated with any recorded data. While these notes will make for interesting stories, they can also uncover the cause of a confusing result from your deployment or spark interesting new research ideas. For example, a robot offering stickers might have all their stickers taken by a single person. Noting this could remind the robot handler to refresh the available stickers, but more importantly it could spark research ideas about whether the robot could prevent people taking more stickers than they should or even how it could detect when such an event is happening. \n Teach robot handlers what kinds of information should be documented. For instance, you can sit with new handlers for an hour during a deployment and indicate when something is note-worthy, what you are writing down, and why it is worthy of documentation."
        },
        {
            "title": "Robot Maintenance",
            "content": [
                "Check the battery health of the robot",
                "Check if all systems continue to function correctly",
                "Check emergency stop"
            ],
            "description": "Regular health checks should be performed on the robot during the deployment. This ensures that the robot is still operating safely and reliably. Robot maintenance will be highly dependent on the specifics of the deployment. For example, a wheeled robot might need its tire pressure periodically checked. Other common maintenance steps might include checking how long the robots battery lasts to assess whether it needs replaced, running unit tests on the systems, and verifying that the emergency stop is operational."
        },
        {
            "title": "Robot Reassessment",
            "content": [
                "Check logs for any unexpected behavior or adverse events",
                "Decide if the robot behavior should change or if the study stopped for any safety or research purposes"
            ],
            "description": "Unfortunately, sometimes a deployment needs to be canceled or postponed. Occasionally, this occurs because of an error in the system, but deployment changes or cancellations can happen for many reasons. Researchers may, for instance, find that a nighttime cleaning robot is being abused and should not be re-deployed until better safety practices are implemented. Frequently checking the logs and saved data can help discover such events, as well as frequent communication with robot handlers. If an error or adverse event is discovered, the research team should assess whether it compromises human or robot safety, or the integrity of the research goals and decide whether to adjust, postpone, or cancel the deployment."
        }
    ],
    "after-robot": [
        {
            "title": "Robot Return Transportation",
            "content": [
                "Arrange for safe return/transportation of the robot",
                "Document the condition of the robot"
            ],
            "description": "Like moving the robot to the site, preparations must be made for returning the robot back to its original location. Often, this requires the same type of preparation as transporting the robot to the site. However, separate arrangements will likely need to be made for the return trip. For instance, if a van is rented to drive the robot to the deployment location, it will likely need to be rented again to make the return trip. Before the robot is removed from the site, document its condition, including any damage, wear, or visible changes. This process helps ensure that the robot is serviced appropriately before it is used again."
        },
        {
            "title": "Robot Infrastructure Teardown",
            "content": [
                "Remove additional equipment (chargers, sensors, markers) added to the environment to support the robot",
                "Utilize an item inventory to ensure all materials are returned",
                "Transport the robot and all auxiliary robot equipment back to its original location",
                "Transfer data from robot onboard cameras or memory",
                "Erase sensitive data from robot memory after transfer (e.g., building maps)"
            ],
            "description": "Besides the robot, all auxiliary equipment must be returned to its home. This might include external sensors, chargers, extension cords, chairs, waypoint markers, or tape on the floor. Not only is this step important to avoid losing equipment, it is also important for maintaining positive relationships with staff at the site. It is usually helpful to create a checklist in advance for setup and teardown of the scene to ensure nothing is forgotten. This will likely be identical or very similar to the checklist prepared for transporting the robot to the site. Often, handling the robot and robot equipment should be done by a trained member of the research team. You may have volunteers to help with the clean up process, but it is best to use their help to pack non-sensitive equipment like study materials and public information signage. \n Data transfer is also a critical piece of returning equipment to its original state. Sensors and robots alike that store data locally need to have all sensitive data backed up to a secure location. Once all data is backed up, all data should be deleted from all sensors and robots to ensure that no data is erroneously leaked to other users of the equipment (like lab mates who are not on the research project team)."
        }
    ],
    "before-human": [
        {
            "title": "Ethics: Consent and Compensation",
            "content": [
                "Assess and address potential ethical risks, especially regarding non-consenting individuals (e.g., children)",
                "Obtain approval to do a study in public from ethical review board",
                "Develop a strategy for people to contact research team",
                "Develop a procedure to delete data on request",
                "Consider compensating participants by distributing freebies"
            ],
            "description": "Complying with ethics requirements is not only essential for obtaining necessary permissions to perform research, it is also good research practice. Before starting a deployment, the risks and impacts should be considered and mitigated as much as possible. \n Because this is designed for public deployments, people may not consent to having their data used for research purposes. In that case, it is imperative that you provide a method of contacting the research team and have a procedure in place for deleting the requested data. It is helpful to know in advance what information you need from the person to delete their data - for instance, you may need to know the date and time that they encountered the robot. \n Though public deployments often do not compensate people who interact with the robot (unlike the traditional model of human subjects research), it is often appropriate to offer a small form of compensation like a sticker, button, or photo to interactants. These freebies can be very small and inexpensive and can be a way of fostering goodwill and expressing appreciation for participants."
        },
        {
            "title": "Data Protection Plan",
            "content": [
                "Confirm compliance with local and national data protection regulations (e.g. GDPR in Europe)",
                "Develop strategies to inform passersby of their right to request deletion of recorded data",
                "Ensure that the length the data is stored aligns with ethics and local regulations",
                "Consider consulting with lawyers (safety, data, lawsuits)"
            ],
            "description": "Different countries and regions have differing requirements for protecting the data of members of the public. For instance, European countries have strict regulations on collecting data in public, whereas the US is much less strict. It is important to read, understand, and comply with local and national regulations on data storage and privacy. This may also include informing passersby that data is being recorded and that they have the right to request that their data be deleted. This process should work in conjunction with the one developed from the ``Ethics: Consent and Compensation'' topic - every deployment should have a process in place to handle this circumstance. Data storage regulations may also include a required minimum or maximum length of time that data is allowed to be stored. In some cases, consulting with a lawyer to ensure compliance with safety and data regulations could be useful to maintain ethical, lawful research practices and avoid the risk of lawsuits. Consulting with a lawyer might be particularly prudent if collecting data in sensitive locations, like churches, or if conducting research on a vulnerable population."
        },
        {
            "title": "Data Storage Plan",
            "content": [
                "Estimate how much data you might collect and select a feasible storage solution",
                "Decide how you will back up your data (cloud, hard disks)",
                "Find ways to label data in a way that will be easy to retrieve and synchronize"
            ],
            "description": "Data storage planning can sometimes feel tedious, but it is a critically important part of planning for a deployment. Estimating data storage needs will help to avoid running out of storage space on the robot during the middle of a deployment. Deliberately overestimate your data storage needs by  10 to 15 percent to help prevent this outcome. Consider backing up data to a secure server during the deployment period if possible. For instance, by running a job each night after the robot is decommissioned for the day. This will be much more feasible if the robot is stored in a location with Ethernet access, or if the robot is returned to the lab at the end of every deployment session. \n Regardless of whether the backup is performed periodically during the deployment or once at the end of the deployment, plans for long-term data storage must be made. At the planning stage, it is also helpful to decide how the data will be labeled to easily retrieve and synchronize. For instance, labeling all data from the same day with the recording timestamp is a good starting point, but if data is recorded in more than one centralized location, this timestamp is unlikely to match exactly. As you develop the robot, try making some test recordings and create a synchronization scheme."
        },
        {
            "title": "Preparation of Study Materials",
            "content": [
                "Prepare observation protocols",
                "Design interview questions",
                "Design questionnaires for members of the public"
            ],
            "description": "Whether conducting interviews, questionnaires, or following observational protocols, all three require the preparation of materials. These materials are often required for ethical approval of a deployment, and are useful to provide to site administrators to help explain the purpose of the research. \n If designing an interview or questionnaire, it is important to consider that members of the public often do not deliberately self-select for research participation in the same way as for in-lab studies. Keeping the interviews and surveys brief and direct will help improve the willingness of member of the public to participate."
        },
        {
            "title": "Study Procedure",
            "content": [
                "Formulate a study plan",
                "Plan the length of your deployment to capture diverse interactions in dynamic public settings",
                "Plan experimental conditions to be robust enough to work in public",
                "Create instructions for setup and teardown that apply on each day of the deplooyment"
            ],
            "description": "Formulating a study plan or procedure is imperative, as this will be provided to any ethical review boards and will likely be required by site administrators to approve the deployment. However, the most helpful aspect of the study plan is that it helps the research team formalize the research goals of the deployment. This guiding plan can help to prioritize competing tasks and recalculate timelines if unexpected delays arise. \n Part of the study plan is also to decide the duration and timing of the deployment. While this may need to adapt based on the availability and willingness of site stakeholders, the deployment will need to be long enough to collect enough data to meet the research goals. It is also good practice to consider deploying the robot in a way that will capture diverse, representative data. For instance, if the robot in a train station is always deployed from 11am-2pm, it will never encounter rush hour. This may be by design if the robot cannot navigate through the crowd density anticipated at rush hour, but limits the generalizability of any findings. \n Many deployments will occur over multiple days. This means that the robot is likely set up and deployed, then shut down for non-deployment hours. On the next deployment day, the steps to start the robot and begin the day's deployment will be repeated. Create a thorough set of instructions for daily set up, start up, shut down, and storage of the robot and any auxiliary equipment like environment cameras or sensors. Having consistent instructions for starting and ending each day of deployment will contribute to more consistent behavior of the robot and results from the deployment."
        },
        {
            "title": "Data Collection and Auxiliary Equipment",
            "content": [
                "Select equipment suitable for documenting your public deployment",
                "Test your equipment and data collection plan in the site",
                "Have a plan to synchronize the data (format, recording rate) from different sources (cameras, microphones), race conditions/version control",
                "Label equipment to ensure it returns to the proper owner",
                "Create an item inventory to ensure that all required equipment is brought to the site"
            ],
            "description": "If additional data collection equipment is used, such as cameras or sensors, this equipment should be chosen to meet the research goals of the deployment. For instance, if a research team is studying affective responses to robots in public, a LIDAR sensor or low-resolution camera will do little good, but a high-resolution RGB camera will provide useful data. All equipment should be tested and practiced with in the lab before testing on site. Data synchronization is often a tricky problem. Make a plan to synchronize the data from different sensors and test this plan both in the lab and at the site. \n Often there is a large amount of equipment needed for a deployment. This includes data collection equipment like external sensors, cameras, tripods, and hard drives, but also might include items like chairs for robot handlers, and clipboards, pens, and handheld recorders for interviewers. Creating an inventory to ensure all needed equipment is brought to the site is very useful for avoiding forgetting anything and enabling the research team to delegate packing work to helpers."
        },
        {
            "title": "Team Training",
            "content": [
                "Safety (e.g., emergency stop)",
                "Robot functions (understand and control)",
                "Operate recording equipment in busy, crowded and distracting settings",
                "Train and pilot data collection methods and public communications"
            ],
            "description": "All research team members, including robot handlers, must be trained for their relevant jobs. Some team members may only transport the robot, some may help with setup, and others may be the robot handlers who stay close to the robot and document observations during the deployment. Some researchers may have many responsibilities. In every case, training materials should be documented for responsibility, and every team member should be trained on robot safety protocol. Responsibilities might include robot startup, shutdown, and monitoring controls, operating equipment for recording and documentation, data collection through surveys or interviews, and public communication, such as answering frequent questions and explaining the purpose of the research. \n Note that some training materials might need to be written for team members with relatively little robot experience. Many robot wranglers are young and excited, but may not have the experience to decipher jargon or respond independently when problems occur. It is good practice to iterate on confusing training materials to continue making them more usable and accessible; a team member with good training helps the whole project run more smoothly."
        },
        {
            "title": "Researcher Support Plan",
            "content": [
                "Consider challenges of fieldwork",
                "Prepare for mixed reactions and emotions"
            ],
            "description": "Researchers working in public or semi-public spaces may face challenges similar to those of traditional field work. Passersby may be inexplicably angry or aggressive, or may be so interested in the robot they make it difficult to monitor the robot. This topic is large and multifaceted, and cannot be fully encapsulated here. Section 5.2 of the main paper elucidates this idea and references additional resources for supporting researchers. \n Research conducted in public can be exhausting, physically, mentally, and emotionally, and it is important to take regular breaks and limit the total amount of time a single person spends at a deployment each day. Make sure to schedule in breaks or shift changes for meals. In some cases, it may be helpful to have two robot handlers at once to improve safety and ease of taking breaks. \n It is also relevant to consider how the dress of a robot handler impacts how they are perceived by members of the public. For instance, a robot handler dressed formally in a casual public setting or one in shorts deploying a robot in the lobby of a fancy office building might stand out negatively. Often, the job of a robot handler is to appear approachable and friendly, or to blend in and not be noticed."
        }
    ],
    "during-human": [
        {
            "title": "Support for Members of the Public",
            "content": [
                "Prepare ways for members of the public to contact researchers",
                "Prepare for frequently asked questions"
            ],
            "description": "When conducting a public HRI study, the researcher needs to anticipate and adapt to respond to people in public settings. The researchers should be easy to \textit{contact} in case members of the publics would like to make requests to the researchers directly, such as requesting their data to be removed after their robot encounter. Mambers of the public will also inevitably \textit{ask questions}. Robot handlers should be prepared to answer frequently asked questions. A typical example would be, ``What is the robot doing?'' As the study progresses, more frequently asked questions can be added to the list. Answers to these questions should be written by a research team member to ensure that the communication between the site authorities and members of the public is correct, consistent, and will not create confounds for the study."
        },
        {
            "title": "Researcher Support",
            "content": [
                "Have an open communication with (in-) formal team members",
                "Have regular debriefing meetings"
            ],
            "description": "Continuing researcher support throughout the deployment is essential. Like supporting researchers before the deployment begins, this topic is broader than we can fully encompass. Additional resources for researcher support are listed in Section 5.4 of the main paper. \n Some ways that you can support researchers during the deployment is to have regular debriefings where researchers can work through tricky situations and share positive encounters. Maintaining open communication between team members is also helpful - if researchers feel like they can reach out to others for help, they will be happier and the deployment will proceed more smoothly."
        },
        {
            "title": "Data Protection Strategies",
            "content": [
                "Evaluate if  signage is sufficient and serving its purpose",
                "Verify that recorded data complies with ethical requirements for privacy"
            ],
            "description": "Once the deployment has started, it is useful to assess the efficacy of any signage posted. For instance, if the research team has posted signs indicating a robot is recording data in the area, but people are not seeing the signs and asking researchers about the robot and data recording, the position, size, or design of the signs may need changed. \n It is also good practice to ensure that all recorded data complies with privacy requirements. For instance, if RGB video cannot be recorded in public, but body tracking information is allowed, ensure that no RGB video is being saved. Sometimes this can be overlooked when transitioning the robot from testing in the lab to deploying in public."
        },
        {
            "title": "Ensure Availability of Study Materials",
            "content": [
                "Print sufficient copies of consent forms and information sheets for large amounts of people in public",
                "Keep materials available at hand in an organized manner"
            ],
            "description": "It is sometimes tricky to obtain more copies of study materials while a deployment is actively happening. Regularly check that sufficient copies of study materials like information sheets and consent forms are available. It is particularly useful to keep this information organized. For instance, signed consent forms should be kept in a separate folder, which also helps to keep a more accurate estimate of the number of blank consent forms available."
        },
        {
            "title": "Documentation of the Deployment",
            "content": [
                "Document adjustments to your study plan",
                "Take photos for paper/archival reasons"
            ],
            "description": "Photos can be especially useful both for note-taking purposes and for communicating about the deployment in presentations and papers. Take photos of the robot in the site, alone and with handlers. Stage photos of the robot interacting with robot handlers or research team members. Refrain, however, from taking photos of members of the public with the robot unless expressly allowed by the ethical review process of your location. \n Sometimes the study plan will change, even as late as during the deployment. In this case, it is especially important to document these changes, as it is often difficult to remember important details after the deployment has ended."
        },
        {
            "title": "Verify Data Recording",
            "content": [
                "Make sure data is stored continuously and correctly",
                "Ensure data recording (non-robot) is verified (i.e., external cameras)",
                "Have procedures on when/how to check the data"
            ],
            "description": "Just like with recording data on the robot, it is essential to verify that external sensors are properly recording data. It is not uncommon to lose data during a research project because a recording was not started correctly. A process for setting up and starting the data recording can be documented to ease the strain of remembering complex steps. It is also helpful to periodically check the data from the external sensors to ensure that they are continuing to record properly and nothing has worn out or broken. Another method of doing this is to run some basic analytics on 1-3 days worth of data. Over this time period, it is reasonable to estimate the amount of data that should be present, and is a good sanity check to ensure that the external recording system is behaving as expected."
        },
        {
            "title": "Dynamic Research Management",
            "content": [
                "Re-evaluate if the location/method for interviews is suitable",
                "Re-evaluate whether unexpected human behavior is occurring and adapt the deployment plan if necessary",
                "Execute/use personalized checklist"
            ],
            "description": "Deployments require periodic reassessment, especially early in the deployment process. Just like an onsite pre-test with the robot can illuminate weak points in the robotic system, once the deployment has started, it is common to discover elements of the deployment plan unrelated to the robot that are causing unexpected problems or even that could just be handled more smoothly. A common source of such problems is the method or location of conducting interviews. If the selected interview location makes people feel like they are blocking someone's path, for instance, they could be less likely to stay for the entire interview. Observations of unexpected human behavior can be good indicators of whether something is going wrong and needs to be reassessed in the deployment plan. However, no deployment will ever be perfect, and there is a tradeoff between re-planning and deployment consistency. Any potential changes should be assessed to ensure that the benefit of the time, effort, and potential obsolescence of earlier data is worth the outcome. \n Another common way that deployments can derail is if robot handlers, interviewers, or other members of the research team forget or overlook important steps of the deployment plan. Creating and using custom checklists for steps of the deployment can help mitigate these problems."
        }
    ],
    "after-human": [
        {
            "title": "Returning Equipment",
            "content": [
                "Remove all study equipment and signage",
                "Return any borrowed equipment to its owner",
                "Create and utilize an item inventory to ensure all materials are returned"
            ],
            "description": "There is often a large quantity of equipment for any robot deployment. This might include chairs for robot handlers, pens, clipboards, handheld recorders, external cameras or sensors, and more. This equipment will all need to be returned to its original owner, and some may be borrowed from other labs or from the site itself. Many people are often involved in the setup and tear-down of a robot deployment - using an inventory sheet to assist helpers in organizing and returning equipment is often very helpful. Labeling equipment with its owner is also a useful way to ensure equipment is returned correctly and timely. \n While all equipment will need to be packed and returned at the end of the deployment, some equipment may need to be packed and stored each day outside of deployment hours. For instance, environment sensors may need to be stored in a secure location with the robot to prevent tampering or theft."
        },
        {
            "title": "Team and Participant Compensation",
            "content": [
                "Compensate helpers (robot handlers, interviewers, and other hired workers)",
                "Compensate interviewees (if applicable)"
            ],
            "description": "In the fervor of finishing a robot deployment, workers should not be overlooked for their compensation. Many robot handlers and study helpers are paid, and their compensation should be agreed in advance. If payment is advertised, interviewees should be paid as quickly, on the day of the interview if possible."
        },
        {
            "title": "Document Initial Observations",
            "content": [
                "Write down notes summarizing interesting observations"
            ],
            "description": "While researchers may have noted individual instances of unique or unexpected events during the deployment, it is useful to document initial observations based on the entirety of the deployment shortly after it finishes. This exercise can illuminate interesting angles to explore within the collected data, and prevents researchers from forgetting these interesting phenomena."
        },
        {
            "title": "Long-Term Data Storage",
            "content": [
                "Transfer data into long term archive to avoid running out of storage space on cameras/robots",
                "Create logs of your obtained data to maintain an overview of what data you collected",
                "Ensure that the length the data is stored aligns with ethics approval and local regulations"
            ],
            "description": "Evaluate the plan created for long-term data storage and determine if any changes need to be made. Generally, a long-term, secure archive should have sufficient space to store all recorded data. Periodic data transfers may be necessary to avoid running out of storage space on cameras and robots. Summary logs of the data can also be very useful once the data is transferred to long-term storage. Sometimes the data will be more difficult to access once it is in long-term storage, and there will likely be a very large quantity of it. Creating logs that indicate specific events of interest can help to find relevant subsets of data. Be sure to adhere to ethical regulations dictating minimum and maximum requirements for the duration of data storage."
        },
        {
            "title": "Data Post-Processing",
            "content": [
                "Label and organize your data in ways that you can easily retrieve later",
                "Map person ID numbers to recordings",
                "Anonymize data",
                "Clean, pre-process, and release open access dataset"
            ],
            "description": "Processing the data while the deployment is fresh is often a good idea. There are frequently nuances to the data, like sections that should be removed or tricks to synchronizing data from multiple sensors, that can be easily forgotten if not documented or acted upon quickly. Apply any labels to the data so that it is easy to retrieve later. For example, researchers could create labels for interesting events that were observed. This will make it much easier in the future to examine these events more closely.\n It is also important in this phase to map person IDs to recordings. Person IDs should be synchronized between the recorded data and human-collected data. For instance, if a person was interviewed, they will have a person ID, and it will likely be useful to know who they were in the recording from the robot. These IDs may also be used to anonymize the data. The local and national regulations for data privacy will often dictate what exactly anonymizing the data entails. In the US, this might mean blurring faces or not saving RGB data. In Europe, video filters may be used to remove details about the perons's facial features, hair color or clothes. \n Consider sharing the data with the HRI community. As we move forward as a field, useful data on public deployments can provide fertile ground for further research."
        }
    ],
    "before-public": [
        {
            "title": "Seek Approval for Deployment",
            "content": [
                "Check local laws regarding data collection in public, particularly regarding video and audio recordings",
                "Develop relationships with site authorities",
                "Identify authorities and building/area owners at the deployment site and get their approval",
                "Coordinate with site stakeholders on a deployment timeline"
            ],
            "description": "Researchers will usually need to obtain permission to deploy the robot. If the site is not clearly owned by an entity, like a public square or park, check local laws regarding use of those types of public spaces. Laws regarding video and audio recording also vary, so check that the type of data you seek to collect is permitted by local and national laws.\n Develop positive relationships with the site administration and stakeholders, which might include building managers or event coordinators and organizers. You will need their permission to deploy the robot, and friendly relationships will contribute significantly to their willingness to be flexible on the robot's behavior and the deployment timeline.  Sometimes, the person who can grant permission for access to the site is different from the person who will help with scheduling the deployment. \n Site stakeholders are also likely to possess useful insight into the site. For instance, they probably have an idea of the typical crowd density or how long people tend to stay at the site. Site stakeholders include people who have authority over the building or area, but they might also include other workers like security guards, secretaries, janitors, or ground workers. These people will likely encounter the robot as they go about their jobs, and will also have valuable insight about the site. Spending the time to develop positive relationships with them will often pay dividends. \n Site authorities often request to see a project proposal as part of the permission process. Be gracious about their request, and make a version of the project plan that contains minimal jargon. Visit the site before you submit this proposal, and include multiple options for where the robot could be deployed and suggested dates for deployment. Since you will be a guest in their space, be courteous about any constraints or requests site authorities make as they review the proposal."
        },
        {
            "title": "Secure Access to Local Infrastructure",
            "content": [
                "Secure access to a reliable internet connection for the robot",
                "Secure access to charging sockets and storage area"
            ],
            "description": "Many robots need connection to Wi-Fi, and all robots will need access to a power source. Often, the site will have internal internet resources that the robot may be allowed to connect to. When possible, coordinating with site technology managers will make this process much easier. \n Storing the robot can alleviate a significant amount of labor associated with transporting the robot. If possible, work with the site administration to coordinate a secure location to store the robot when not actively being deployed. This might be a storage closet, an unused conference room, or even someone's office. Remember to be gracious when coordinating the use of a storage location."
        },
        {
            "title": "Plan for Accessibility",
            "content": [
                "Make note of accessible routes and plan not to obstruct them (e.g., wheelchair ramps, curb cuts, emergency exits)"
            ],
            "description": "There will likely be areas at the site that are built for accessibility, like wheelchair ramps, curb cuts, tactile paving, or emergency exits. These tools may be very handy to enable robot mobility, like using curb cuts for driving onto sidewalks or accessing spaces through emergency exits. However, it is important to remember the intended purpose of these tools - that is, even if the robot is making use of accessibility tools, none of these areas should be blocked or impeded by the robot's presence. Emergency exits in particular should never be obstructed for safety purposes."
        },
        {
            "title": "Inform the Public about the Deployment",
            "content": [
                "Consider advertising the deployment beforehand in local outlets (newspapers, billboards)",
                "Consider informing about the ongoing deployment by placing visible signs in the area or on the robot",
                "Develop a strategy for passersby to receive results of the study",
                "Consider if you need a cover story"
            ],
            "description": "Members of the public that encounter the robot may want advance notice that the robot is present and recording data. This might involve advertising the deployment in advance, which serves the dual purpose of generating excitement and forewarning the robot's presence. Additionally, some ethical reviews or local laws will require onsite notices visible throughout the deployment indicating that data is being recorded. These signs can include information about contacting researchers and where members of the public can find results of the study. \n Some robot deployments may need a ``cover story'' to explain what the robot is doing. For instance, if the research goals are about testing a new method of social navigation, telling people this might change the way that they move around the robot, which is counterproductive. A way to mitigate this effect is to focus on another part of the robot's behavior when describing it to members of the public. For instance, the robot testing social navigation methods could be described as a robot trying to make deliveries. It is important, however, not to lie when framing a narrative about the robot's presence. Unless specifically allowed through an ethical review process, any story told about the robot should be true, but it need not highlight the primary research goals of the deployment."
        }
    ],
    "during-public": [
        {
            "title": "Maintain Contact with Stakeholders",
            "content": [
                "Present intermediate results iteratively to interested stakeholders"
            ],
            "description": "Many site authorities and stakeholders will be interested in periodic updates on the deployment. This is a good way to maintain the positive relationships that were built previously. Updates can be relatively simple, like sharing how many people have interacted with the robot or an interesting anecdote from the deployment. Note that not everyone will be interested in receiving these updates."
        },
        {
            "title": "Risk Management",
            "content": [
                "Maintain an ongoing dialogue with non-team staff (e.g., shop owners) present at the deployment site (e.g. info desk in the building)",
                "Provide contact information to relevant stakeholders (e.g. building managers, emergency responders)"
            ],
            "description": "Non-authority site stakeholders like building staff, groundskeepers, janitors, or security guards can help with risk management. For instance, their presence may dissuade robot abuse, or they may have useful insight into potential pitfalls. Providing contact information for a primary contact on the research team to site stakeholders can be useful in case of emergencies. Keep in mind, however, that these stakeholders are not themselves robot handlers, and the robot (or monitoring the robot) should not impede their actual job function. "
        },
        {
            "title": "Secure Accessibility and Safety",
            "content": [
                "Check if emergency exits and elevators are not blocked"
            ],
            "description": "Egress routes like elevators, doors, and emergency exits must remain open and unobstructed throughout the entire deployment. Even if the robot moves past, or even uses, these areas, they must not be blocked by the robot. A plan should have been made to avoid this, but it is the job of robot programmers and robot handlers to ensure compliance."
        },
        {
            "title": "Inform the Public",
            "content": [
                "Have a researcher on site who can answer questions and explain the deployment",
                "Provide written information in visible and accessible locations",
                "Put up an info box where members of the public can leave their email address if they want to know about the results",
                "Evaluate if additional outreach events are necessary"
            ],
            "description": "While it is often the case that many members of the research team and temporary robot handlers are sufficiently prepared to answer questions from members of the public, major deployments with a large research team may require a team member to be trained specifically on interfacing with the public. This team member may additionally hold other roles, but having a specific team member trained for public outreach and talking with pedestrians and news outlets alleviates the need for all team members to be prepared to speak on behalf of the entire project. \n When setting up information signs at the deployment site, researchers should take note of where they placed the signs. Sometimes other objects in the environment, like tables, benches, planters, or displays, move, so originally planned sign locations may need to be adjusted. Taking notes will help ensure that no sign is left behind during site cleanup. \n In addition to informational signs, providing a mechanism for members of the public to request additional information often mitigates a frequently asked question, and prepares robot handlers for how to address interested members of the public. This could be in the form of an info box, a physical or virtual information sign-up sheet, or something else entirely. Based on the interest and feedback from members of the public, the research team may need to discuss if additional outreach is necessary."
        }
    ],
    "after-public": [
        {
            "title": "Site Cleanup",
            "content": [
                "Remove any posters or other materials for public information sharing from the deployment site",
                "Utilize an item inventory to ensure all materials are returned"
            ],
            "description": "Like with cleanup of other materials, it is important to leave the site as it was found. Using a material inventory to ensure everything is packed is useful and prevents leaving equipment behind. \n While the site will need to be reset at the end of the deployment, some site cleanup may be required each day outside of deployment hours. This should be discussed with site authorities."
        },
        {
            "title": "Engage with Local Authorities",
            "content": [
                "Write thank you notes/emails and seek support of future collaboration with local authorities",
                "Send results if desired"
            ],
            "description": "Part of conducting a public HRI study will always be the camaraderie or rapport a researcher may establish with people such as building managers, maintenance staff, or local IT professionals. It is good practice to express gratitude via thank you notes or emails. For some researchers who hope to continue engaging with the same communities it can be important to continue to foster and support these relationships. It is also typical for researchers to send results if requested by other stakeholders (e.g. an on-site staff member who would like to see any final publications or outcomes). Often people even request to see intermediate results or the end product before it is published. Results shared with non-experts should be communicated without jargon or overly technical language."
        },
        {
            "title": "Engage Local Infrastructure Providers",
            "content": [
                "Pay any costs (e.g. building use fees)",
                "Inform about the completion of the deployment",
                "Send results if desired"
            ],
            "description": "In the final steps of a deployment, ensure that all payments have been made for infrastructure used. This may be separate from coordination with the site administration. For example, a city may have a fee to use a public square for a robot deployment. The fee should be paid to the city, but the event coordinator is the primary contact for obtaining permission and answering logistical questions about the deployment. Once the deployment is finished, it is good practice to send a final email thanking any infrastructure providers and informing them that the deployment is finished and all materials have been removed from the site."
        },
        {
            "title": "Inform the Public about the Results",
            "content": [
                "Report back to the community (e.g. through news articles, popular science events)"
            ],
            "description": "Since we are doing research with members of the public, we as researchers have a responsibility to share our findings. Dissemination of research to the public can happen in a variety of ways, including news articles in local media or organizing a science event at the deployment site. At minimum, researchers should consider putting a link to a project website on informational signs and posting project results that are written without jargon in a way that lay members of the public can understand."
        }
    ]
}